{
  "table_name": "cloudflare_load_balancer_pool",
  "table_description": "A pool is a group of origin servers, with each origin identified by its IP address or hostname.",
  "columns": [
    {
      "name": "id",
      "type": "text",
      "description": "The API item identifier."
    },
    {
      "name": "name",
      "type": "text",
      "description": "A short name for the pool."
    },
    {
      "name": "enabled",
      "type": "boolean",
      "description": "Status of this pool. Disabled pools will not receive traffic and are excluded from health checks."
    },
    {
      "name": "monitor",
      "type": "text",
      "description": "The ID of the Monitor to use for health checking origins within this pool."
    },
    {
      "name": "created_on",
      "type": "timestamp with time zone",
      "description": "Timestamp when the pool was created."
    },
    {
      "name": "description",
      "type": "text",
      "description": "Description for the pool."
    },
    {
      "name": "latitude",
      "type": "text",
      "description": "The latitude this pool is physically located at; used for proximity steering. Values should be between -90 and 90."
    },
    {
      "name": "longitude",
      "type": "text",
      "description": "The longitude this pool is physically located at; used for proximity steering. Values should be between -180 and 180."
    },
    {
      "name": "minimum_origins",
      "type": "integer",
      "description": "The minimum number of origins that must be healthy for this pool to serve traffic. If the number of healthy origins falls below this number, the pool will be marked unhealthy and we will failover to the next available pool. Default: 1."
    },
    {
      "name": "modified_on",
      "type": "timestamp with time zone",
      "description": "Timestamp when the pool was last modified."
    },
    {
      "name": "notification_email",
      "type": "text",
      "description": "The email address to send health status notifications to. This can be an individual mailbox or a mailing list. Multiple emails can be supplied as a comma delimited list."
    },
    {
      "name": "check_regions",
      "type": "json",
      "description": "A list of regions (specified by region code) from which to run health checks."
    },
    {
      "name": "load_shedding",
      "type": "json",
      "description": "Setting for controlling load shedding for this pool."
    },
    {
      "name": "origins",
      "type": "json",
      "description": "The list of origins within this pool. Traffic directed at this pool is balanced across all currently healthy origins, provided the pool itself is healthy."
    }
  ]
}