{
  "table_name": "aws_api_gatewayv2_route",
  "table_description": "AWS API Gateway Version 2 Route",
  "columns": [
    {
      "name": "route_key",
      "type": "text",
      "description": "The route key for the route."
    },
    {
      "name": "api_id",
      "type": "text",
      "description": "Represents the identifier of an API."
    },
    {
      "name": "route_id",
      "type": "text",
      "description": "The route ID."
    },
    {
      "name": "api_gateway_managed",
      "type": "boolean",
      "description": "Specifies whether a route is managed by API Gateway."
    },
    {
      "name": "api_key_required",
      "type": "boolean",
      "description": "Specifies whether an API key is required for this route. Supported only for WebSocket APIs."
    },
    {
      "name": "authorization_type",
      "type": "text",
      "description": "The authorization type for the route. For WebSocket APIs, valid values are NONE for open access, AWS_IAM for using AWS IAM permissions, and CUSTOM for using a Lambda authorizer For HTTP APIs, valid values are NONE for open access, JWT for using JSON Web Tokens, AWS_IAM for using AWS IAM permissions, and CUSTOM for using a Lambda authorizer."
    },
    {
      "name": "authorizer_id",
      "type": "text",
      "description": "The identifier of the Authorizer resource to be associated with this route. The authorizer identifier is generated by API Gateway when you created the authorizer."
    },
    {
      "name": "model_selection_expression",
      "type": "text",
      "description": "The model selection expression for the route. Supported only for WebSocket APIs."
    },
    {
      "name": "operation_name",
      "type": "text",
      "description": "The operation name for the route."
    },
    {
      "name": "route_response_selection_expression",
      "type": "text",
      "description": "The route response selection expression for the route. Supported only for WebSocket APIs."
    },
    {
      "name": "target",
      "type": "text",
      "description": "The target for the route."
    },
    {
      "name": "authorization_scopes",
      "type": "json",
      "description": "A list of authorization scopes configured on a route. The scopes are used with a JWT authorizer to authorize the method invocation. The authorization works by matching the route scopes against the scopes parsed from the access token in the incoming request. The method invocation is authorized if any route scope matches a claimed scope in the access token. Otherwise, the invocation is not authorized. When the route scope is configured, the client must provide an access token instead of an identity token for authorization purposes."
    },
    {
      "name": "request_models",
      "type": "json",
      "description": "The request models for the route. Supported only for WebSocket APIs."
    },
    {
      "name": "request_parameters",
      "type": "json",
      "description": "The request parameters for the route. Supported only for WebSocket APIs."
    },
    {
      "name": "title",
      "type": "text",
      "description": ""
    }
  ]
}