{
  "table_name": "linode_domain",
  "table_description": "Domains in the Linode account.",
  "columns": [
    {
      "name": "id",
      "type": "integer",
      "description": "The unique ID of this Domain."
    },
    {
      "name": "domain",
      "type": "text",
      "description": "The domain this Domain represents. These must be unique in our system; you cannot have two Domains representing the same domain."
    },
    {
      "name": "axfr_ips",
      "type": "json",
      "description": "The list of IPs that may perform a zone transfer for this Domain. This is potentially dangerous, and should be set to an empty list unless you intend to use it."
    },
    {
      "name": "description",
      "type": "text",
      "description": "A description for this Domain. This is for display purposes only."
    },
    {
      "name": "domain_type",
      "type": "text",
      "description": "If this Domain represents the authoritative source of information for the domain it describes, or if it is a read-only copy of a master (also called a slave)."
    },
    {
      "name": "expire_sec",
      "type": "integer",
      "description": "The amount of time in seconds that may pass before this Domain is no longer authoritative."
    },
    {
      "name": "master_ips",
      "type": "json",
      "description": "The IP addresses representing the master DNS for this Domain."
    },
    {
      "name": "refresh_sec",
      "type": "integer",
      "description": "The amount of time in seconds before this Domain should be refreshed."
    },
    {
      "name": "retry_sec",
      "type": "integer",
      "description": "The interval, in seconds, at which a failed refresh should be retried."
    },
    {
      "name": "soa_email",
      "type": "text",
      "description": "Start of Authority email address. This is required for master Domains."
    },
    {
      "name": "status",
      "type": "text",
      "description": "Used to control whether this Domain is currently being rendered: disabled, active, edit_mode, has_errors."
    },
    {
      "name": "tags",
      "type": "json",
      "description": "Tags applied to this domain as a map."
    },
    {
      "name": "tags_src",
      "type": "json",
      "description": "List of Tags applied to this domain."
    },
    {
      "name": "ttl_sec",
      "type": "integer",
      "description": "Time to Live - the amount of time in seconds that this Domain's records may be cached by resolvers or other domain servers."
    }
  ]
}