{
  "table_name": "azuread_directory_audit_report",
  "table_description": "Represents the list of audit logs generated by Azure Active Directory.",
  "columns": [
    {
      "name": "id",
      "type": "text",
      "description": "Indicates the unique ID for the activity."
    },
    {
      "name": "activity_date_time",
      "type": "timestamp with time zone",
      "description": "Indicates the date and time the activity was performed."
    },
    {
      "name": "activity_display_name",
      "type": "text",
      "description": "Indicates the activity name or the operation name."
    },
    {
      "name": "category",
      "type": "text",
      "description": "Indicates which resource category that's targeted by the activity."
    },
    {
      "name": "correlation_id",
      "type": "text",
      "description": "Indicates a unique ID that helps correlate activities that span across various services. Can be used to trace logs across services."
    },
    {
      "name": "logged_by_service",
      "type": "text",
      "description": "Indicates information on which service initiated the activity (For example: Self-service Password Management, Core Directory, B2C, Invited Users, Microsoft Identity Manager, Privileged Identity Management."
    },
    {
      "name": "operation_type",
      "type": "text",
      "description": "Indicates the type of operation that was performed. The possible values include but are not limited to the following: Add, Assign, Update, Unassign, and Delete."
    },
    {
      "name": "result",
      "type": "text",
      "description": "Indicates the result of the activity. Possible values are: success, failure, timeout, unknownFutureValue."
    },
    {
      "name": "result_reason",
      "type": "text",
      "description": "Indicates the reason for failure if the result is failure or timeout."
    },
    {
      "name": "additional_details",
      "type": "json",
      "description": "Indicates additional details on the activity."
    },
    {
      "name": "initiated_by",
      "type": "json",
      "description": "Indicates information about the user or app initiated the activity."
    },
    {
      "name": "target_resources",
      "type": "json",
      "description": "Indicates information on which resource was changed due to the activity. Target Resource Type can be User, Device, Directory, App, Role, Group, Policy or Other."
    },
    {
      "name": "title",
      "type": "text",
      "description": "ColumnDescriptionTitle"
    },
    {
      "name": "tenant_id",
      "type": "text",
      "description": "ColumnDescriptionTenant"
    }
  ]
}